app/Models/BookModel.php

SELECT *
FROM `books`
ORDER BY `id` DESC
---
    public function getBook(){
        return $this->orderBy('id','desc')->findAll();

SELECT *
FROM `books`
WHERE `id` = '11'
 LIMIT 1
---
    public function updateBooks($id){
        return $this->where('id', $id)->first();